ejabberd_tsung_test/chat-12k.xml
<?xml version="1.0"?><tsung loglevel="info" version="1.0" dumptraffic="false">

  <clients>
    <client host="ejabberdproject" maxusers="200000"/>
  </clients>

  <servers>
    <server host="ejabberdproject" port="5222" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="14400" unit="minute">
      <users maxnumber="24000" interarrival="0.001" unit="second"/>
    </arrivalphase>
  </load>

  <options>
    <option type="ts_jabber" name="global_number" value="24000"/>
    <option type="ts_jabber" name="userid_max" value="100000"/>
    <option type="ts_jabber" name="domain" value="localhost"/>
    <option type="ts_jabber" name="username" value="user"/>
    <option type="ts_jabber" name="passwd" value="pass"/>
  </options>

  <sessions>
   <session bidi="true" probability="100" name="xmpp" type="ts_jabber">

      <request subst="true">
        <jabber type="connect" ack="no_ack"/>
      </request>

      <thinktime value="1"/>

      <transaction name="auth">
        <request><jabber type="auth_sasl" ack="local"/></request>
        <request><jabber type="connect" ack="local"/></request>
        <request><jabber type="auth_sasl_bind" ack="local"/></request>
        <request><jabber type="auth_sasl_session" ack="local"/></request>
      </transaction>

      <thinktime value="1"/>

      <request subst="true">
        <jabber type="presence:initial" ack="no_ack"/>
      </request>

      <for from="1" to="100" incr="1" var="j">
        <request subst="true">
          <jabber type="chat" ack="no_ack" size="500" destination="online"/>
        </request>
        <thinktime value="5"/>
      </for>

      <request subst="true">
        <jabber type="presence:final" ack="no_ack"/>
      </request>

  </session>
 </sessions>
</tsung>